# Elevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectPosition..::..Elevation Property
ProjectPosition Class See Also
---
Elevation above ground level.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Elevation { get; set; }
```

Visual Basic
---
```text
Public Property Elevation As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Elevation {
	double get ();
	void set (double value);
}
```

# Remarks
Negative values are allowed. Measured in decimal feet.
# See Also
ProjectPosition Class
Autodesk.Revit.DB Namespace